/**
 * 服务端定义的错误码和消息
 * @author jameszuo
 * @date 13-1-16
 */

define(function (require, exports, module) {

    var
        MAP = {
            0: '操作成功',
            404: '连接服务器超时，请稍后再试',
            1000: '出现未知错误',
            1008: '无效的请求命令字',
            1010: false, //'对应目录列表查询请求，代表该目录下的信息未修改，客户端不需要刷新该目录下的本地缓存列表。',
            1012: '系统正在初始化，请稍后再试',
            1013: '存储系统繁忙，请稍后再试',
            1014: '服务器繁忙，请稍后再试',
            1015: '创建用户失败',
            1016: '不存在该用户',
            1017: '无效的请求格式', // 请求包格式解析错误
            1018: false, //'要拉取的目录列表已经是最新的',
            1019: '目录不存在',
            1020: '文件不存在',
            1021: '目录已经存在',
            1022: '文件已经存在',
            1023: '上传地址获取失败', //'上传文件时，索引创建成功，上传地址获取失败，客户端需要发起续传',
            1024: '登录状态超时，请重新登录', // 验证clientkey失败
            1025: '存储系统繁忙，请稍后再试',
            1026: '父目录不存在',
            1027: '无效的目录信息', //不允许在根目录下上传文件
            1028: '目录或文件数超过总限制',
            1029: '单个文件大小超限',
            1030: '签名已经超时，请重新验证独立密码',
            1031: '验证独立密码失败',
            1032: '设置独立密码失败',
            1033: '删除独立密码失败',
            1034: '失败次数过多，独立密码被锁，请稍后再试',
            1035: '独立密码不能与QQ密码相同',
            1051: '该目录下已经存在同名文件',
            1052: '该文件未完整上传，无法下载',
            1053: '剩余空间不足',
            1070: '不能分享超过2G的文件', // 使用批量分享后貌似没有大小限制了，要和@ajianzheng、@bondli 确认下。- james
            1076: '根据相关法律法规和政策，该文件禁止分享',

            1083: '该目录下文件个数已达上限，请清理后再试',
            1086: '网盘文件个数已达上限，请清理后再试',
            1088: '无效的文件名',
            1117: '部分文件或目录不存在，请刷新后再试',

            3002: '不能对不完整的文件进行该操作',
            3008: '不能对空文件进行该操作',
            4000: '登录状态超时，请重新登录',
            10000: '登录状态超时，请重新登录',
            10408: '该文件已加密，无法下载',

            100001: '参数无效',
            100002: '无效的请求格式', //Json格式无效
            100003: '请求中缺少协议头',
            100004: '请求中缺少协议体',
            100005: '请求中缺少字段',
            100006: '无效的命令',
            100007: '导入数据请求无效',
            100008: '目录的ID长度无效', //'目录的key长度无效',
            100009: '文件的SHA值长度无效',
            100010: '文件的MD5值长度无效',
            100011: '文件的ID长度无效',
            100012: '返回数据过长导致内存不足',
            100016: '指针无效',
            100017: '时间格式无效',
            100019: '输入字段类型无效',
            100027: '无效的文件名',
            100028: '文件已过期',
            100029: '文件超过下载次数限制',
            100030: '收听官方微博失败',
            100031: '用户未开通微博',
            100033: '分享到微博失败',
            100034: '内容中出现脏字、敏感信息',
            100035: '用户限制禁止访问',
            100036: '内容超限',
            100037: '帐号异常',
            100038: '请休息一下吧',
            100039: '请勿重复发表微博',
            100040: '身份验证失败',

            114200: '文件已被删除', // 要分享的资源已被删除
            114201: '文件已损坏',
            114503: '该文件可能存在风险，暂时无法分享',
            190051: '登录状态超时，请重新登录',
            190054: '访问超过频率限制',
            190055: '服务器暂时不可用，请稍后再试',
            199012: '同时操作的目标数量过多', // 例如限定一次删除100个，发送了包含120对象的请求
            190041: '服务器内部错误，请稍后再试',

            //分享链接邮件发送相关错误码
            102033: '参数错误',
            102034: '服务器内部错误',
            102035: '网络错误',
            102501: '非法请求',
            102502: '输入参数错误',
            102503: '非法的用户号码',
            102504: 'QQMail未激活',
            102505: 'skey验证不通过',
            102506: '邮件被拦截',
            102508: '发送频率过高',
            102601: '收件人总数超过限制',
            102602: '邮件大小超过限制',
            102603: '邮件发送失败',
            102037: '超出频率限制，请输入验证码',
            102038: '验证码错误',


            // 库 - 相册
            210009: '分组不存在',
            210010: '不能删除默认分组',
            210011: '分组名不能为空',
            210012: '分组名重复',

            // ------ 2.0 返回码 -------------------------
            190013: '无效的请求，请刷新页面后重试',
            199013: '拒绝访问',
            13004: '操作频率过快，请稍后再试'
        },
        //PB2.0 在此定义公共的错误码( 范围(190000-19900) )
        MAP_NEW = {
            190011     : '无效的QQ号码',
            190012     : '无效的命令字',
            190013     : '请求参数错误',
            190014     : '客户端主动取消,如关闭连接',
            190020     : '组cmem包错误',
            190021     : '解包cmem包错误',
            190030     : '组ptlogin包失败',
            190031     : '组pb协议包失败',
            190032     : '解析pb协议包失败',
            190033     : '解析http协议失败',
            190034     : '解析json协议失败',
            190035     : '解析xml协议失败',
            190036     : 'http状态码非200',
            190039     : '无效的appid',
            190040     : 'UIN在黑名单中',
            190041     : 'Server内部错误',
            190042     : '后端服务器超时',
            190043     : '后端服务器进程不存在',
            190044     : '解析后端回包失败',
            190045     : '获取L5路由失败',
            190046     : '服务器组包失败',
            190047     : '严重错误，必须要引起重视',
            190048     : '无效的APPID',
            190049     : '可能违反互联网法律法规或腾讯服务协议',
            190050     : '会话被强制下线',
            190051     : '验证登录态失败',
            190052     : '用户不在白名单中',
            190053     : '用户在黑名单中',
            190054     : '访问超过频率限制',
            190055     : '服务器临时不可用',
            190056     : 'cmem key不存在',
            190057     : 'cmem key过期',
            190058     : 'cmem 没有数据',
            190059     : 'cmem 设置时cas不匹配',
            190060     : 'cmem 数据有误',
            190061     : '无效的签名类型:请求身份验证凭证类型',
            190062     : '解签名失败',
            190063     : '解密数据失败',
            190064     : '批量操作条目超上限',
            190065     : 'st签名过期，需要终端去换取新的Key',
            190066     : '终端在同步的过程中，需要从头进行一次全量列表拉取',
            190067     : '敏感文字',
            190071     : '链接被对端关闭',
            190072     : '策略限制',


            190201     : '没有JSON头',
            190202     : '没有JSON体',
            190203     : '缺少必要参数',
            190204     : '参数值类型不正确',

            //CGI公共错误码(199001-199999)
            199001     : '回调callback参数异常',
            199002     : 'op_source参数有误',
            199003     : 'dir_key长度无效',
            199004     : '文件sha长度无效',
            199005     : '文件md5长度无效',
            199006     : '',
            199007     : '日志时间格式无效',
            199008     : '域名不对',
            199009     : 'referer有问题',
            199010     : 'token有误',
            199011     : 'fileid长度无效',
            199012     : '某参数超过配置限制',
            199013     : '下载校验失败',
            199014     : '用户请求信息非法',

            //Server的错误码
            1000:   "服务器出错",
            1013:   "存储平台系统繁忙",
            1015:   "在存储平台创建用户失败",
            1016:   "存储平台不存在该用户",
            1018:   "要拉取的目录列表已经是最新的",
            1019:   "目录不存在",
            1020:   "文件不存在",
            1021:   "目录ID已经使用",
            1022:   "文件已传完",
            1026:   "父目录不存",
            1027:   "不允许在根目录下上传文件",
            1028:   "目录或者文件数超过总限制",
            1029:   "单个文件大小超限",
            1051:   "重名错误",
            1052:   "下载未完成上传的文件",
            1053:   "当前上传的文件超过可用空间大小",
            1054:   "不允许删除系统目录",
            1055:   "不允许移动系统目录",
            1056:   "该文件不可移动",
            1057:   "续传时源文件已经发生改变",
            1058:   "删除文件版本冲突",
            1059:   "覆盖文件版本冲突",
            1060:   "禁止查询根目录",
            1061:   "禁止修改根目录属性",
            1062:   "禁止删除根目录",
            1063:   "不能删除非空目录",
            1064:   "禁止拷贝未上传完成文件",
            1065:   "不允许修改系统目录",
            1066:   "原始外链url参数太长，超过了1022字节",
            1067:   "短URL服务错误",
            1068:   "短URL服务来源字段错误",
            1069:   "短URL服务会数据包大小校验失败",
            1070:   "生成外链文件大小不符合规则",
            1073:   "外链失效，下载次数已超过限制",
            1074:   "黑名单校验失败, 其它原因",
            1075:   "黑名单校验失败，没有找到sha",
            1076:   "非法文件，文件在黑名单中",
            1080:   "名字太长",
            1081:   "GET_APP_INFO时带的错误的source值",
            1082:   "修改目录时间戳出错",
            1083:   "目录或者文件数超单个目录限制",
            1084:   "生成vaskey失败",
            1085:   "批量操作不能为空",
            1086:   "批量操作条目超上限",
            1088:   "文件名目录名无效",
            1090:   "无效的MD5",
            1091:   "转存的文件未完成上传",
            1092:   "转存的文件名无效编码",
            1093:   "无效的业务ID",
            1094:   "读取转存文件失败",
            1095:   "转存文件已过期",
            1096:   "设置flag失败",
            1097:   "ftn preuploadblob解码失败",
            1098:   "请求体中的业务号与业务blob中的业务号不一致",
            1099:   "非法的目标业务号",
            1100:   "微云preuploadblob解码失败",
            1101:   "非法的文件前10M MD5",
            1102:   "asn编码失败",
            1103:   "存储存在此用户",
            1110:   "转存到微云的文件名中含有非法字符",
            1111:   "源、目的目录相同目录，不能移动文件",
            1112:   "不允许文件或目录移动到根目录下",
            1113:   "不允许文件复制到根目录下",
            1114:   "移动索引不一致，存储需要修复",
            1115:   "删除文件并发冲突,可以重试解决",
            1116:   "不允许用户在根目录下创建目录",
            1117:   "批量下载中某个目录或文件不存在",
            1118:   "认证签名无效",
            1119:   "目的父目录不存在",
            1120:   "目的父父目录不存在",
            1121:   "源父目录不存在",
            1122:   "目录文件修改名称时，源目的相同",
            1123:   "不允许在根目录下创建目录",
            1124:   "访问旁路系统出错",
            1125:   "黑名单",
            1126:   "非秒传文件太大禁止上传",


            1301:   "微云网盘用户不存在",
            1302:   "QQ网盘用户不存在",

            1901:   "独立密码签名已经超时，需要用户重新输入密码进行验证",
            1902:   "独立密码验证失败",
            1903:   "开通独立密码失败",
            1904:   "删除独立密码失败",
            1905:   "输入过于频繁",
            1906:   "添加的独立密码和QQ密码相同",
            1908:   "独立密码已经存在",
            1909:   "修改密码失败",
            1910:   "新老密码一样",
            1911:   "不存在老密码，请用添加流程",
            1912:   "策略限制",
            1913:   "独立密码验证失败(密码错误)",
            1914:   "失败次数过多,独立密码被锁定",
            1915:   "认证签名无效",

            20418: '无效app_secret或access_token',
            20410: '微信access_token过期'

        },

    // Server内部错误，需要重试的码
        NEED_RETRY = {190041: 1, 190042: 1, 190043: 1},

        UNKNOWN_MSG = '网络错误，请稍后再试',

        undefined;

    var ret_msgs = {

        get: function (code) {
            var msg = MAP[code] || MAP_NEW[code];

            if (msg === false) {
                return '';
            } else {
                return msg || UNKNOWN_MSG;
            }
        },

        is_sess_timeout: function (code) {
            return code === 1024 || code === 10000 || code === 190051 || code === 4000 || code === 190011 || code === 199034 || code === 20410 || code === 20418;
        },

        is_indep_invalid: function (code) {
            return code === 1031;
        },

        /**
         * 判断是否是需要重试的错误码
         * @param {Number} code
         * @returns {boolean}
         */
        is_need_retry: function (code) {
            return code in NEED_RETRY;
        },

        UNKNOWN_MSG: UNKNOWN_MSG,

        TIMEOUT_CODE: 404, // 连接服务器超时

        UNKNOWN_CODE: 1000,
        INVALID_SESSION: 1024,  // 未登录
        INVALID_SESSION2: 10000,
        INVALID_INDEP_PWD: 1031, // 无效的独立密码

        INCOMPLETE_FILE: 3002, // 未完成的文件
        EMPTY_FILE: 3008, // 空文件
        SHARE_FILE_OVER_SIZE: 1070, // 分享的文件过大

        FILE_NOT_EXIST: 1020, //文件不存在
        ACCESS_FREQUENCY_LIMIT: 13004 // 频率限制
    };

    return ret_msgs;
});
