/**
 * 错误码信息
 * User: bondli
 * Date: 13-11-13
 * Time: 下午7:12
 * To change this template use File | Settings | File Templates.
 */
define(function (require, exports, module) {

	return {
		msg_obj : {
            114503: "该外链侵犯了他人利益，已失效。",
			114302: "链接已失效，请联系文件所有者重新分享。",
			1020:	"链接已失效，请联系文件所有者重新分享。",
			1026:	"分享资源已经删除，请联系文件所有者重新分享。",
			114201: "分享的数据已经被破坏，请联系文件所有者重新分享。",
			114200: "分享资源已经删除，请联系文件所有者重新分享。",
			190056: "分享已被取消，请联系文件所有者重新分享。",
			1052:	"获取分享信息超时，请稍后重试。",
			404:    "获取分享信息超时，请稍后重试。",
			1014:	"获取分享信息超时，请稍后重试。",
			113502: "链接无效请检查您输入的链接是否完整。",
			114203: "链接无效请检查您输入的链接是否完整。",
			215005: "分享内容不存在，请联系分享者重新分享",
			215012: "分享内容暂时无法查看，请稍后重试。",
			1014:	"系统繁忙，请稍后重试。",
			1000:	"系统繁忙，请稍后重试。",
			114300: "系统繁忙，请稍后重试。",
			114301: "系统繁忙，请稍后重试。",
			113001: "系统繁忙，请稍后重试。",
			113000: "系统繁忙，请稍后重试。",
            20000: {
                msg: "因系统升级，分享页面暂时无法访问",
                desc: "给您造成的不便，敬请谅解。"
            },
            20002: "链接已过期，请联系分享者重新分享。",
            20003: "外链使用次数已用完，请联系分享者重新分享。"
		},
		get : function (code) {
	    	return this.msg_obj[code] || '链接已失效，请联系文件所有者重新分享。';
	    }
	};

});